#@ # 
#@ # Running icc2_shell Version U-2022.12 for linux64 -- Dec 11, 2022
#@ # Date:   Sat Apr 29 14:24:06 2023
#@ # Run by: aedc4@computerlab-pc4
#@ 

start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
#/* Top-level Module                                  */
set top_module mvm_uart_system
#/* Library Name                                      */
set library_name uart_icc2
set PDKDIR /home/aedc4/libs/tsmc_32nm/SAED32_EDK
set SAED32_EDK /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
set synopsys /home/aedc4/Apps/syn/T-2022.03-SP5-1
set search_path [concat $search_path $SAED32_EDK/stdcell_hvt $SAED32_EDK/stdcell_hvt/db_nldm]
set link_library {* saed32hvt_ss0p7v125c.db}
set_app_options -list {lib.configuration.default_flow_setup {}};
set_app_options -list {lib.configuration.output_dir {CLIBs}}
set_app_options -list {lib.configuration.lef_site_mapping {}}
set_app_options -list {lib.configuration.process_label_mapping {}}
set_app_options -list {lib.configuration.display_lm_messages {false}}
#----------------------------------------------
#   Create Library
#----------------------------------------------
create_lib -ref_libs {/home/aedc4/0_SysV_Mewan/ASIC_flow_ass_3/libs/saed32nm_hvt_1p9m.lef} -technology /home/aedc4/0_SysV_Mewan/ASIC_flow_ass_3/libs/saed32nm_1p9m_mw.tf $library_name
read_parasitic_tech -name {parasitics} -tlup {/home/aedc4/0_SysV_Mewan/ASIC_flow_ass_3/libs/saed32nm_1p9m_Cmax.tluplus} -layermap {/home/aedc4/0_SysV_Mewan/ASIC_flow_ass_3/libs/saed32nm_tf_itf_tluplus.map}
read_verilog -library uart_icc2 -top mvm_uart_system ../../output/mvm_uart_system.out.v
link_block
win_set_filter -visible -class cell -filter {clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class pseudo_bump -filter {deleted}
win_set_filter -visible -class pseudo_tsv -filter {deleted}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-82}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class pseudo_bump -filter {deleted}
win_set_filter -class pseudo_tsv -filter {deleted}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-82}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
save_block uart_icc2:mvm_uart_system
win_select_objects -slct_targets global -at {2.175 0.055} -radius 0.0089
change_selection 
initialize_floorplan -core_offset {5}
connect_pg_net -automatic
create_pg_ring_pattern ring_pattern -horizontal_layer M1    -horizontal_width {1.5} -horizontal_spacing {0.5}    -vertical_layer M2 -vertical_width {1.5} -vertical_spacing {0.5}
set_pg_strategy core_ring    -pattern {{name: ring_pattern}    {nets: {VDD VSS}} {offset: {0.5 0.5}}} -core
compile_pg -strategies core_ring
connect_pg_net -automatic
create_pg_mesh_pattern mesh_pattern -layers { {{horizontal_layer: M1} {width: 0.75} {pitch: 7.5} {spacing: interleaving}}  {{vertical_layer: M2} {width: 0.84} {pitch: 8.4} {spacing: interleaving}} }
set_pg_strategy mesh_strategy -polygon {{0.000 0.000} {72.168 71.864}} -pattern {{pattern: mesh_pattern}{nets: {VDD VSS}}} -blockage {macros: all}
create_pg_std_cell_conn_pattern std_cell_pattern
set_pg_strategy std_cell_strategy -polygon {{0.000 0.000} {72.168 71.864}} -pattern {{pattern: std_cell_pattern}{nets: {VDD VSS}}}
compile_pg -ignore_via_drc
set_app_options -name plan.pins.incremental -value true -block [current_block]
set_app_options -name plan.pins.layer_range -value 5 -block [current_block]
set_app_options -name plan.pins.pin_range -value 10.00 -block [current_block]
place_pins -self -ports {clk rstn rx tx}
save_lib -all
set_app_options -name place.coarse.fix_hard_macros -value false
set_app_options -name plan.place.auto_create_blockages -value auto
create_placement -floorplan -timing_driven
save_lib -all
set_app_options -name place.coarse.fix_hard_macros -value false
set_app_options -name plan.place.auto_create_blockages -value auto
create_placement -floorplan -timing_driven
save_lib -all
clear
set_app_options -name place.coarse.fix_hard_macros -value false
set_app_options -name plan.place.auto_create_blockages -value auto
create_placement -floorplan -timing_driven -incremental -effort medium
compile
change_selection [get_blocks -all -lib_cells uart_icc2:mvm_uart_system.design]
gui_set_setting -window [gui_get_current_window -types BlockDiagram -mru] -setting BlockDiagram:background_color -value black
gui_set_setting -window [gui_get_current_window -types BlockDiagram -mru] -setting zoomFitFactor -value 0.0
gui_set_setting -window [gui_get_current_window -types BlockDiagram -mru] -setting BlockDiagram_net:annotTextVisible -value false
gui_set_setting -window [gui_get_current_window -types BlockDiagram -mru] -setting BlockDiagram_net:annotTextSize -value {}
gui_set_setting -window [gui_get_current_window -types BlockDiagram -mru] -setting BlockDiagram_net:annotTextClip -value {}
change_selection [get_blocks -all -lib_cells uart_icc2:mvm_uart_system.design]
change_selection [get_blocks -all -lib_cells uart_icc2:mvm_uart_system.design]
gui_set_setting -window [gui_get_current_window -types Schematic -mru] -setting schematic:background_color -value black
gui_set_setting -window [gui_get_current_window -types Schematic -mru] -setting zoomFitFactor -value 0.0
change_selection [get_blocks -all -lib_cells uart_icc2:mvm_uart_system.design]
change_selection 
create_placement -floorplan -timing_driven -incremental -effort medium
change_selection [get_blocks -all -lib_cells uart_icc2:mvm_uart_system.design]
change_selection 
change_selection [get_blocks -all -lib_cells uart_icc2:mvm_uart_system.design]
change_selection 
change_selection [get_blocks -all -lib_cells uart_icc2:mvm_uart_system.design]
change_selection 
exit
