 
                              IC Compiler II (TM)

                  Version U-2022.12 for linux64 - Dec 11, 2022
  This release has significant feature enhancements. Please review the Release
                       Notes associated with this release.

                    Copyright (c) 1988 - 2022 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)

icc2_shell> start_gui
icc2_shell> #/* Top-level Module                                  */
icc2_shell> set top_module mvm_uart_system
mvm_uart_system
icc2_shell> #/* Library Name                                      */
icc2_shell> set library_name fa_icc2
fa_icc2
icc2_shell> set PDKDIR /home/aedc4/libs/tsmc_32nm/SAED32_EDK
/home/aedc4/libs/tsmc_32nm/SAED32_EDK
icc2_shell> set SAED32_EDK /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
/home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
icc2_shell> set synopsys /home/aedc4/Apps/syn/T-2022.03-SP5-1
/home/aedc4/Apps/syn/T-2022.03-SP5-1
icc2_shell> set search_path [concat $search_path $SAED32_EDK/stdcell_hvt $SAED32_EDK/stdcell_hvt/db_nldm]
. /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm
icc2_shell> set link_library {* saed32hvt_ss0p7v125c.db}
* saed32hvt_ss0p7v125c.db
icc2_shell> set_app_options -list {lib.configuration.default_flow_setup {}};
lib.configuration.default_flow_setup {}
icc2_shell> set_app_options -list {lib.configuration.output_dir {CLIBs}}
lib.configuration.output_dir CLIBs
icc2_shell> set_app_options -list {lib.configuration.lef_site_mapping {}}
lib.configuration.lef_site_mapping {}
icc2_shell> set_app_options -list {lib.configuration.process_label_mapping {}}
lib.configuration.process_label_mapping {}
icc2_shell> set_app_options -list {lib.configuration.display_lm_messages {false}}
lib.configuration.display_lm_messages false
icc2_shell> #----------------------------------------------
icc2_shell> #   Create Library
icc2_shell> #----------------------------------------------
icc2_shell> create_lib -ref_libs {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_hvt_1p9m.lef} -technology /home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_mw.tf $library_name
Error: extra positional option 'fa_icc2' (CMD-012)
icc2_shell> read_parasitic_tech -name {parasitics} -tlup {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_Cmax.tluplus} -layermap {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_tf_itf_tluplus.map}
Error: Current library is not defined. (LIB-001)
icc2_shell> #/* Top-level Module                                  */
icc2_shell> set top_module mvm_uart_system
mvm_uart_system
icc2_shell> #/* Library Name                                      */
icc2_shell> set library_name fa_icc2
fa_icc2
icc2_shell> set PDKDIR /home/aedc4/libs/tsmc_32nm/SAED32_EDK
/home/aedc4/libs/tsmc_32nm/SAED32_EDK
icc2_shell> set SAED32_EDK /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
/home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
icc2_shell> set synopsys /home/aedc4/Apps/syn/T-2022.03-SP5-1
/home/aedc4/Apps/syn/T-2022.03-SP5-1
icc2_shell> set search_path [concat $search_path $SAED32_EDK/stdcell_hvt $SAED32_EDK/stdcell_hvt/db_nldm]
. /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm
icc2_shell> set link_library {* saed32hvt_ss0p7v125c.db}
* saed32hvt_ss0p7v125c.db
icc2_shell> set_app_options -list {lib.configuration.default_flow_setup {}};
lib.configuration.default_flow_setup {}
icc2_shell> set_app_options -list {lib.configuration.output_dir {CLIBs}}
lib.configuration.output_dir CLIBs
icc2_shell> set_app_options -list {lib.configuration.lef_site_mapping {}}
lib.configuration.lef_site_mapping {}
icc2_shell> set_app_options -list {lib.configuration.process_label_mapping {}}
lib.configuration.process_label_mapping {}
icc2_shell> set_app_options -list {lib.configuration.display_lm_messages {false}}
lib.configuration.display_lm_messages false
icc2_shell> #----------------------------------------------
icc2_shell> #   Create Library
icc2_shell> #----------------------------------------------
icc2_shell> create_lib -ref_libs {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_hvt_1p9m.lef} -technology /home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_mw.tf fa_icc2
Error: extra positional option 'fa_icc2' (CMD-012)
icc2_shell> read_parasitic_tech -name {parasitics} -tlup {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_Cmax.tluplus} -layermap {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_tf_itf_tluplus.map}
Error: Current library is not defined. (LIB-001)
icc2_shell> #/* Top-level Module                                  */
icc2_shell> set top_module mvm_uart_system
mvm_uart_system
icc2_shell> #/* Library Name                                      */
icc2_shell> set library_name fa_icc2
fa_icc2
icc2_shell> set PDKDIR /home/aedc4/libs/tsmc_32nm/SAED32_EDK
/home/aedc4/libs/tsmc_32nm/SAED32_EDK
icc2_shell> set SAED32_EDK /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
/home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
icc2_shell> set synopsys /home/aedc4/Apps/syn/T-2022.03-SP5-1
/home/aedc4/Apps/syn/T-2022.03-SP5-1
icc2_shell> set search_path [concat $search_path $SAED32_EDK/stdcell_hvt $SAED32_EDK/stdcell_hvt/db_nldm]
. /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm
icc2_shell> set link_library {* saed32hvt_ss0p7v125c.db}
* saed32hvt_ss0p7v125c.db
icc2_shell> set_app_options -list {lib.configuration.default_flow_setup {}};
lib.configuration.default_flow_setup {}
icc2_shell> set_app_options -list {lib.configuration.output_dir {CLIBs}}
lib.configuration.output_dir CLIBs
icc2_shell> set_app_options -list {lib.configuration.lef_site_mapping {}}
lib.configuration.lef_site_mapping {}
icc2_shell> set_app_options -list {lib.configuration.process_label_mapping {}}
lib.configuration.process_label_mapping {}
icc2_shell> set_app_options -list {lib.configuration.display_lm_messages {false}}
lib.configuration.display_lm_messages false
icc2_shell> #----------------------------------------------
icc2_shell> #   Create Library
icc2_shell> #----------------------------------------------
icc2_shell> create_lib -ref_libs {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_hvt_1p9m.lef} -technology /home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_mw.tf
Error: Unable to access directory '/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/scripts/flow_ass_3/libs'; path is invalid (FILE-005)
Error: problem in create_lib
        Use error_info for more info. (CMD-013)
icc2_shell> read_parasitic_tech -name {parasitics} -tlup {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_Cmax.tluplus} -layermap {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_tf_itf_tluplus.map}
Error: Current library is not defined. (LIB-001)
icc2_shell> #/* Top-level Module                                  */
icc2_shell> set top_module mvm_uart_system
mvm_uart_system
icc2_shell> #/* Library Name                                      */
icc2_shell> set library_name uart_icc2
uart_icc2
icc2_shell> set PDKDIR /home/aedc4/libs/tsmc_32nm/SAED32_EDK
/home/aedc4/libs/tsmc_32nm/SAED32_EDK
icc2_shell> set SAED32_EDK /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
/home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib
icc2_shell> set synopsys /home/aedc4/Apps/syn/T-2022.03-SP5-1
/home/aedc4/Apps/syn/T-2022.03-SP5-1
icc2_shell> set search_path [concat $search_path $SAED32_EDK/stdcell_hvt $SAED32_EDK/stdcell_hvt/db_nldm]
. /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt /home/aedc4/libs/tsmc_32nm/SAED32_EDK/lib/stdcell_hvt/db_nldm
icc2_shell> set link_library {* saed32hvt_ss0p7v125c.db}
* saed32hvt_ss0p7v125c.db
icc2_shell> set_app_options -list {lib.configuration.default_flow_setup {}};
lib.configuration.default_flow_setup {}
icc2_shell> set_app_options -list {lib.configuration.output_dir {CLIBs}}
lib.configuration.output_dir CLIBs
icc2_shell> set_app_options -list {lib.configuration.lef_site_mapping {}}
lib.configuration.lef_site_mapping {}
icc2_shell> set_app_options -list {lib.configuration.process_label_mapping {}}
lib.configuration.process_label_mapping {}
icc2_shell> set_app_options -list {lib.configuration.display_lm_messages {false}}
lib.configuration.display_lm_messages false
icc2_shell> #----------------------------------------------
icc2_shell> #   Create Library
icc2_shell> #----------------------------------------------
icc2_shell> create_lib -ref_libs {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_hvt_1p9m.lef} -technology /home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_mw.tf $library_name
Error: extra positional option 'uart_icc2' (CMD-012)
icc2_shell> read_parasitic_tech -name {parasitics} -tlup {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_1p9m_Cmax.tluplus} -layermap {/home/aedc4/0_SysV_Mewan/ASIC flow_ass_3/libs/saed32nm_tf_itf_tluplus.map}
Error: Current library is not defined. (LIB-001)
icc2_shell> exit
Maximum memory usage for this session: 458.67 MB
Maximum memory usage for this session including child processes: 458.67 MB
CPU usage for this session:    101 seconds (  0.03 hours)
Elapsed time for this session:   1937 seconds (  0.54 hours)
Thank you for using IC Compiler II.

